Repository: ddalcu/mlx-serve
Catalog: app/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Video
zh_hans: 视频

source: Video Generation
zh_hans: 视频生成

source: Video Generation (LTX-Video 2.3)
zh_hans: 视频生成（LTX-Video 2.3）

source: View Releases ↗
zh_hans: 查看发布记录 ↗

source: Vision (image input)
zh_hans: 视觉（图像输入）

source: Vocal language
zh_hans: 人声语言

source: Voice
zh_hans: 语音

source: Voice clone clip
zh_hans: 声音克隆片段

source: Voice engine
zh_hans: 语音引擎

source: Voice mode (%@) — talk to the model hands-free. Speech-to-text and text-to-speech run locally on your Mac; the model only handles text (and tools/thinking if enabled).
zh_hans: 语音模式（%1$@）—— 免动手与模型交谈。语音识别与语音合成都在你的 Mac 本地运行；模型只处理文本（以及已启用的工具／思考）。

source: Voices blend: type several separated by commas (af_bella,af_sky) to make a new one.
zh_hans: 声音混合：用逗号分隔输入多个（af_bella,af_sky）即可合成新声音。

source: Voices, lip sync and timing follow this clip — it becomes the video's soundtrack. Runs on the 2-stage pipeline.
zh_hans: 人声、口型和时间轴都跟随这段片段 —— 它会成为视频的配乐。使用两阶段流程运行。

source: WAV, MP3, M4A or AAC. The clip drives the performance and becomes the video's soundtrack.
zh_hans: WAV、MP3、M4A 或 AAC。该片段驱动表演，并成为视频的配乐。

source: Waiting for approval
zh_hans: 等待批准

source: Wake phrase
zh_hans: 唤醒词

source: Wants to run “%@”
zh_hans: 请求运行“%1$@”

source: Wants to run “%@”. %@
zh_hans: 想要运行“%1$@”。%2$@

source: Web
zh_hans: 联网

source: Weights not found
zh_hans: 未找到权重

source: What changed in each version, including the one you're running.
zh_hans: 每个版本的更新内容，包括你当前运行的这一版。

source: What you say to address the assistant in hands-free voice mode. Case and punctuation don't matter, and common greetings (hey, hi, okay…) are accepted before the name. The assistant takes the last word as its name. Empty = "Hey Loki".
zh_hans: 在免提语音模式中用来呼叫助手的说法。大小写和标点不影响识别，名字前也可以带上常见的招呼语（hey、hi、okay…）。助手会把最后一个词当作自己的名字。留空则为 "Hey Loki"。

source: Where this agent's file and shell tools run. Several agents may share a folder.
zh_hans: 该智能体的文件与终端工具的运行位置。多个智能体可共用一个文件夹。

source: Who you're talking to. An agent brings its own prompt, voice, tools, workspace and model; “None” uses the app's own settings, exactly as before. Say another agent's wake phrase to hand the conversation over mid-session.
zh_hans: 你正在与谁对话。智能体自带提示词、声音、工具、工作区和模型；选“无”则完全沿用应用自身的设置。说出另一个智能体的唤醒词，可在会话中途把对话交接过去。

source: Work items, pull requests, builds, pipelines, wiki, test plans
zh_hans: 工作项、拉取请求、构建、流水线、wiki 与测试计划

source: Workspace
zh_hans: 工作区

source: Workspace: %@
zh_hans: 工作区：%1$@

source: Workspace…
zh_hans: 工作区…

source: Write the server log to ~/.mlx-serve/logs/mlx-serve-<port>.log (32 MB rotation, one file per port). This is the file to check after a crash — the in-app log viewer only holds what arrived while the app was running.
zh_hans: 将服务器日志写入 ~/.mlx-serve/logs/mlx-serve-<port>.log（32 MB 轮转，每个端口一个文件）。崩溃后应查看这个文件 — 应用内的日志查看器只保留应用运行期间收到的内容。

source: Written from the description under the name.
zh_hans: 根据名称下方的描述写成。

source: Your Mac
zh_hans: 你的 Mac

source: Your voices
zh_hans: 你的声音

source: [exit %d]
zh_hans: [退出码 %1$d]

source: [timed out]
zh_hans: [已超时]

source: a tool
zh_hans: 某个工具

source: agent
zh_hans: 智能体

source: could not download the sandbox kernel (HTTP %lld)
zh_hans: 无法下载沙盒内核（HTTP %1$lld）

source: could not pull the sandbox base image "%@" (%@): %@
zh_hans: 无法拉取沙盒基础镜像 "%1$@"（%2$@）：%3$@

source: downloaded sandbox kernel lacks virtiofs support — release asset mismatch
zh_hans: 下载的沙盒内核缺少 virtiofs 支持 — 发布文件不匹配

source: e.g. a blunt Swift code reviewer that never comments on style
zh_hans: 例如：一个直言不讳、从不评论代码风格的 Swift 代码审查者

source: error
zh_hans: 错误

source: every weekday at 8am · or a cron expression
zh_hans: 每个工作日早上 8 点 · 或填写 cron 表达式

source: llama.cpp's KV-quant scheme (ggml Q8_0 / Q4_0). Same trade as the MLX version: less KV RAM, slower decode — leave off for maximum tokens/sec if you have plenty of RAM. Distinct kernels from the MLX KV-quant; auto-enables flash-attn on the server side when non-default.
zh_hans: llama.cpp 的 KV 量化方案（ggml Q8_0 / Q4_0）。与 MLX 版本的权衡相同：KV 内存更小，解码更慢 — 内存充裕、追求最高 token/秒时请保持关闭。它与 MLX 的 KV 量化使用不同的内核；设为非默认值时会在服务端自动启用 flash-attn。

source: malformed
zh_hans: 格式错误

source: mlx-serve is free and open source, built by one person. Star it, follow along, or just say hello — questions and bug reports are welcome.
zh_hans: mlx-serve 是一个人开发的免费开源项目。欢迎点个星标、持续关注，或者只是打个招呼 — 也欢迎提问和反馈问题。

source: mlx-serve is free and open source. A star helps other people find it.
zh_hans: mlx-serve 是免费开源的。加个星标能帮助更多人发现它。

source: no model is loaded — start the server before opening a %@ session
zh_hans: 尚未加载模型 — 请先启动服务器，再打开 %1$@ 会话

source: none
zh_hans: 无

source: none detected
zh_hans: 未检测到

source: not set
zh_hans: 未设置

source: off
zh_hans: 关闭

source: on
zh_hans: 开启

source: optional — I2V
zh_hans: 可选 —— 图生视频

source: optional — audio-to-video
zh_hans: 可选 —— 音频生视频

source: optional — the generation follows them
zh_hans: 可选 —— 生成会跟随它们

source: or drag one here
zh_hans: 或把文件拖到这里

source: poolside's full-size coding specialist, built for writing and editing code and for multi-step “agent” work like using tools across a whole project. A large mixture-of-experts model — 117 billion parameters in total, but only about 8.5 billion wake up per word — in poolside's own 4-bit NVFP4 build, the quantization the model ships in. Needs a Mac with a lot of memory; the XS above covers smaller machines.
zh_hans: poolside 的完整版编程专用模型，用于编写和修改代码，以及在整个项目中使用工具这类多步“智能体”工作。这是一个大型混合专家模型 — 总参数 1170 亿，但每个词只唤醒约 85 亿 — 采用 poolside 自己的 4 位 NVFP4 构建，也是该模型发布时的量化格式。需要内存充足的 Mac；内存较小的机器请选择上面的 XS。

source: random
zh_hans: 随机

source: sandbox failed to start: %@. Turn off the Agent Sandbox in Settings to run on the host, or check the base image. (guest console tail written to the server log)
zh_hans: 沙盒启动失败：%1$@。可在设置中关闭智能体沙盒以在主机上运行，或检查基础镜像。（客户机控制台的末尾内容已写入服务器日志）

source: scale %@
zh_hans: 强度 %1$@

source: starting
zh_hans: 正在启动

source: the Agent Sandbox requires Apple Silicon (the guest kernel is arm64)
zh_hans: 智能体沙盒需要 Apple 芯片（客户机内核为 arm64）

source: the bundled guest is missing vsock support or the vz-agent binary — the app bundle is incomplete
zh_hans: 随附的客户机缺少 vsock 支持或 vz-agent 可执行文件 — 应用包不完整

source: the guest network never came up — no ssh mirror on localhost:%u
zh_hans: 客户机网络始终没有就绪 — localhost:%1$u 上没有 ssh 映射

source: the sandbox guest has no ssh channel — turn on guest networking in Settings → Agent Sandbox
zh_hans: 沙盒客户机没有 ssh 通道 — 请在“设置 → 智能体沙盒”中开启客户机网络

source: ~%llds recommended
zh_hans: 建议约 %1$lld 秒

source: · %lld on disk
zh_hans: · 本地 %1$lld 个

source: ↩ ask · esc close
zh_hans: ↩ 提问 · esc 关闭

source: ⚠ %@ failed
zh_hans: ⚠ %1$@ 失败

source: ✓ On disk
zh_hans: ✓ 已在本地
